#+TITLE: Geometrically Deriving M_p/M_e
#+AUTHOR: Nolan Eakins <nolan@eakins.net>

* Abstract

The ratio between the mass of a proton to that of an electron is derived from the geometry of quantum space-time.

* Introduction

There have been any attempts at calculating the ratio between a proton and an electron. [fn:MpMe]
While it is easy to accept the value of the ratio, 1836, [fn:WP-proton] as a given, light would be shed on the Universe if this value can be derived from first principles.
Using the map provided by quantum space-time, this article will demonstrate that the $\frac{M_{p^+}}{M_{e^-}}$ ratio is encoded in the geometry of quantum space-time.

* Quantum Space-time

Quantum space-time as described by Thad Roberts theorizes that space-time itself is a superfluid made from elemental quantums of space. [fn:EI]
These quantums contain a volume of space and would be exactly like voxels except QST places these in a three dimensional super-space where their superfluid motions can take place.
What results is a fuzzy picture, where the "voxels" move and jitter, at the lowest level to any observer that spans many of these "voxels".

Light in QST is a wave through the superfluid of spaces.
This means at the smallest level light is one quanta colliding with another quanta.
These back and forth collisions set the speed of light.

As with any wave in any medium, the density of the quantums will cause light to have a curved path while traveling through different densities.
Since light curves around masses per General Relativity, space is thus more dense around more massive objects.

The more massive proton is surrounded by more space than an electron.
The amount of space should be proportional to their masses.
Therefore the number of quantums around a proton to an electron should be the same ratio of their masses:

\begin{equation}
\frac{Q_{p^+}}{Q_{e^-}} \approx \frac{M_{p^+}}{M_{e^-}}
\end{equation}

* Our Particles

** 1q

Since $Q_{e^-}$, the number of quanta in an electron, is in the denominator we can assume that it is one.
To move spatially, a single energized quanta needs to collide with another quanta.
This is a *tick*.

\begin{equation}
\def\bsquare{\unicode{x25A0}}
\def\square{\unicode{x25A1}}
\bsquare \rightarrow \square
\end{equation}

To do so in all three spatial dimensions, it needs to collide with three quantums.
One quantum for each side of the quantum in the direction of motion.

\begin{equation}
\def\bsquare{\unicode{x25A0}}
\def\square{\unicode{x25A1}}
\bsquare \rightarrow \square ^ \square _ \square
\end{equation}

** 2q

Now it's possible for quantums to coalesce into structures.
A two quantum structure is just that: two quantums.
Twice the space and twice the number of sides.

Unlike a single quanta, two quanta can not move in a single tick.
It needs to move two quanta to move its length.
This can take 2 ticks, but by time this has occurred two more ticks in the direction of motion will have been caused.

\begin{equation}
\bsquare \bsquare \rightarrow \square \rightarrow \square \rightarrow \square \rightarrow \square
\end{equation}

To move spatially, these two quanta both need to collide with a quanta for each axis in the direction of motion.
Instead of three quanta, this is six quanta.
As this introduces 4 ticks, we need to take into account 4 layers of quanta like this. 6 quanta leads to 18 quanta and so on until 162q 4 ticks away.

(todo fig)


** 3q

Three quanta is exactly that: three times the quanta with three times the sides.
Unlike two quantums, three can take up to three ticks or sometimes two depending on their arrangement.
50:50 odds will be assumed for this article's approximation.

\begin{equation}
\bsquare^\bsquare_\bsquare \rightarrow \square \rightarrow \square \rightarrow \square \rightarrow \square
\end{equation}

\begin{equation}
\bsquare \bsquare \bsquare \rightarrow \square \rightarrow \square \rightarrow \square \rightarrow \square \rightarrow \square \rightarrow \square
\end{equation}

Just like two quanta, there needs to be three quanta for each quanta to move.
As more ticks are involved the number of quanta involved exponentially grows.
Therefore this oscillation will cause up to 729 quanta to be needed.

This can be generalized as: $\frac{6Q}{2} \cdot 3^{2T-1}, T > 1$

** 4q

\begin{equation}
\bsquare^\bsquare_\bsquare\bsquare \rightarrow \square \rightarrow \square \rightarrow \square \rightarrow \square
\end{equation}

* Results

As can be seen in the table, 1q needs a tick to move into 3q yielding a product of 3.
2q needs 2 ticks to move into 162q for a product of 648,
and 3q roughly averages 2.5 ticks to move into 729q for a product of 5467.5.

| # of quanta | # ticks | # quanta in way | $Product$ | $\frac{Product}{Product_{1}}$ |
|-------------+---------+-----------------+-----------+-------------------------------|
|           1 |       1 |               3 |         3 |                             1 |
|           2 |       2 |             162 |       648 |                           216 |
|           3 |     2.5 |            729. |    5467.5 |                        1822.5 |
|           4 |     2.5 |            972. |     9720. |                         3240. |
#+TBLFM: $3=($1*6/2)*3^if($1<=1, 0, (2*$2)-1)::$4=$3*$2*$1::$5=$4/@2$4

Dividing those products by 1q's product the $1q:2q:3q$ ratio is $1:216:1822$.
That's extremely close to $M_{e^-}:M_\mu:M_{p^+} \rightarrow 0.511:105.7:938.3 \rightarrow 1:207:1836$.

Beyond 3q, we hit a number that nears that of $M_{e^-}:M_\tau \rightarrow 0.511:1776.82 \rightarrow 1:3477$ at 4q[fn:WP-muon].

* Conclusion

These numbers are of the magnitude required to agree with the measured values of $M_{p^+}$, $M_{e^-}$, and even $M_\mu$.
As evidenced by the average in 3q, further refinement should be possible by taking into account the actual super-spatial motions.
With this it's safe to conclude that mass is a function of a number of volumes, their surface area, and time.

[fn:EI] /Einstein's Intuition/, Thad Roberts, 2015, http://einsteinsintuition.com/
[fn:MpMe] An Essay on Numerology of the Proton to Electron Mass Ratio, Alexander Kritov, /Progress In Physics/, Volume 11 (2015), Issue 1 (January) http://www.ptep-online.com/index_files/2015/PP-40-04.PDF
[fn:WP-proton] Proton, /Wikipedia/, https://en.wikipedia.org/wiki/Proton
[fn:WP-muon] Muon, /Wikipedia/, https://en.wikipedia.org/wiki/Muon

* Code

#+BEGIN_COMMENT
#+BEGIN_SRC emacs-lisp
(let ((a (* 1 3 (expt 3 1) 1))
      (b (* 2 6 (expt 3 4) 2))
      (c (* 3 9 (expt 3 5) 2.5))
      (d (* 4 12 (expt 3 6) 3))
      (e (* 5 15 (expt 3 10) 5)))
  `(,(/ a a) ,(/ b a) ,( / c a) ,(/ d a) ,(/ e a)))

(defun q (n ticks)
  (* (/ (* n 6) 2) (expt 3 (if (<= n 1) 1 (* 2 ticks)))))

(defun m (n ticks)
  (* n (q n ticks) ticks))

(setf m1 (m 1 1))

(list (/ (m 1 1) m1)
  (/ (m 2 2) m1)
  (/ (m 3 (/ (+ 2 3) 2.0)) m1)
  (/ (m 4 3) m1)
  (/ (m 5 4) m1))

(list (m 1 1)
  (m 2 2)
  (m 3 (/ (+ 2 3) 2.0))
  (m 4 3)
  (m 5 4))

(list (q 1 1) (q 2 2) (q 3 2.5) (q 4 3))

#+END_SRC
#+END_COMMENT
